Revit 2016 API
FabricSheet.BentFabricWiresOrientation Property
 Specifies the placement of the non-bent bars in the fabric sheet.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public BentFabricWiresOrientation BentFabricWiresOrientation { get; set; }
Visual Basic
Public Property BentFabricWiresOrientation As BentFabricWiresOrientation
	Get
	Set
Visual C++
public:
property BentFabricWiresOrientation BentFabricWiresOrientation {
	BentFabricWiresOrientation get ();
	void set (BentFabricWiresOrientation value);
}
Remarks
 This parameter applies only to bent fabric sheets.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: the data-setting method is not applicable to fabric sheets that are flat
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InvalidObjectException |  When setting this property: The data-setting method is not applicable to fabric sheets that are flat.
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace